
1.	Задать массив из 8 элементов и вывести их на экран (сделано)
2.	Задать массив из 8 элементов, заполненных нулями и единицами вывести их на экран (сделано)
3.	Задать массив из 12 элементов, заполненных числами из [0,9]. (сделано)(сложно)
Найти сумму положительных/отрицательных элементов массива?? 
Первый метод положительных второй метод отрицательных. 
4.	Написать программу замену элементов массива на противоположные 
5.	Определить, присутствует ли в заданном массиве, некоторое число 
6.	Задать массив, заполнить случайными положительными трёхзначными числами. Показать количество нечетных\четных чисел 
7.	В одномерном массиве из 123 чисел найти количество элементов из отрезка [10,99] 
8.	Найти сумму чисел одномерного массива стоящих на нечетной позиции 
9.	Найти произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

10.	В Указанном массиве вещественных чисел найдите разницу между максимальным и минимальным элементом


// Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

double[] newarray(int n)// массив
{
    double[] array = new double[n];
    return array;
}

double[] randomArray(double[] array)\\печатать массив
{
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().NextDouble()*10;
        Console.Write(" " + array[i]);
    }
    Console.WriteLine();
    return array;
}

double summ(double[] ar)
{
    double summ = 0;
    double min = ar[0];
    double max = ar[0];

    for (int i = 0; i < ar.Length; i++)
    {
        if (ar[i] < min)
        {
            min = ar[i];
        }
        if (ar[i] > max)
        {
            max = ar[i];
        }
        summ = max - min;
    }
    return summ;
}
int n = 5;
double[] array = newarray(n);
array = randomArray(array);
double summa = summ(array);
Console.WriteLine(summa);

